/*
Navicat MySQL Data Transfer

Source Server         : Local
Source Server Version : 50622
Source Host           : 127.0.0.1:3306
Source Database       : lpt

Target Server Type    : MYSQL
Target Server Version : 50622
File Encoding         : 65001

Date: 2016-11-01 21:24:18
*/

SET FOREIGN_KEY_CHECKS=0;

-- ----------------------------
-- Table structure for `about`
-- ----------------------------
DROP TABLE IF EXISTS `about`;
CREATE TABLE `about` (
  `abo_id` int(11) NOT NULL AUTO_INCREMENT,
  `abo_content` text,
  `abo_version` varchar(10) NOT NULL,
  PRIMARY KEY (`abo_id`)
) ENGINE=InnoDB AUTO_INCREMENT=2 DEFAULT CHARSET=utf8;

-- ----------------------------
-- Records of about
-- ----------------------------
INSERT INTO `about` VALUES ('1', '*****有限公司是一个刚注册公司。', '1.1.8');

-- ----------------------------
-- Table structure for `admin`
-- ----------------------------
DROP TABLE IF EXISTS `admin`;
CREATE TABLE `admin` (
  `adm_id` int(11) NOT NULL AUTO_INCREMENT,
  `adm_name` varchar(16) NOT NULL,
  `adm_pwd` varchar(10) NOT NULL,
  `adm_sex` varchar(2) DEFAULT NULL,
  `adm_phone` varchar(13) NOT NULL,
  `adm_type` varchar(15) NOT NULL,
  `adm_state` int(1) NOT NULL,
  PRIMARY KEY (`adm_id`)
) ENGINE=InnoDB AUTO_INCREMENT=41 DEFAULT CHARSET=utf8;

-- ----------------------------
-- Records of admin
-- ----------------------------
INSERT INTO `admin` VALUES ('1', 'admin', '12345', '男', '15775692039', '管理员', '1');
INSERT INTO `admin` VALUES ('2', 'admin2', '1234', '男', '15708182072', '管理员', '0');
INSERT INTO `admin` VALUES ('28', 'admin3', 'aaaa', '女', '15775695659', '管理员', '0');
INSERT INTO `admin` VALUES ('38', '冉椿林', '1234', '男', '15775692033', '超级管理员', '1');
INSERT INTO `admin` VALUES ('40', '中国联通', '1234', '男', '18998562145', '加盟者', '1');

-- ----------------------------
-- Table structure for `advert`
-- ----------------------------
DROP TABLE IF EXISTS `advert`;
CREATE TABLE `advert` (
  `adv_img` varchar(50) NOT NULL,
  `adv_content` text,
  `adv_url` varchar(50) DEFAULT NULL,
  `adv_hotlevel` int(1) NOT NULL,
  `adv_id` int(11) NOT NULL AUTO_INCREMENT,
  `adv_time` varchar(40) NOT NULL,
  PRIMARY KEY (`adv_id`)
) ENGINE=InnoDB AUTO_INCREMENT=7 DEFAULT CHARSET=utf8;

-- ----------------------------
-- Records of advert
-- ----------------------------
INSERT INTO `advert` VALUES ('a', 'a', 'a', '1', '1', '2016-08-31 15:00:00');
INSERT INTO `advert` VALUES ('b', 'b', 'b', '1', '2', '2016-08-30 15:00:00');
INSERT INTO `advert` VALUES ('c', 'c', 'c', '1', '3', '2016-08-29 15:00:00');
INSERT INTO `advert` VALUES ('d', 'd', 'd', '1', '4', '2016-08-28 15:00:00');
INSERT INTO `advert` VALUES ('e', 'e', 'e', '1', '5', '2016-07-30 15:00:00');
INSERT INTO `advert` VALUES ('f', 'f', 'f', '1', '6', '2015-08-30 15:00:00');

-- ----------------------------
-- Table structure for `apply`
-- ----------------------------
DROP TABLE IF EXISTS `apply`;
CREATE TABLE `apply` (
  `app_id` int(11) NOT NULL AUTO_INCREMENT,
  `app_task` int(11) NOT NULL,
  `app_beuser` int(11) NOT NULL,
  `app_reason` text,
  `app_state` int(1) NOT NULL,
  `app_time` varchar(40) NOT NULL,
  PRIMARY KEY (`app_id`),
  KEY `FK_task_apply` (`app_task`),
  KEY `FK_user_apply` (`app_beuser`),
  CONSTRAINT `apply_ibfk_1` FOREIGN KEY (`app_task`) REFERENCES `task` (`tas_id`) ON DELETE CASCADE ON UPDATE CASCADE,
  CONSTRAINT `apply_ibfk_2` FOREIGN KEY (`app_beuser`) REFERENCES `users` (`use_id`) ON DELETE CASCADE ON UPDATE CASCADE
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

-- ----------------------------
-- Records of apply
-- ----------------------------

-- ----------------------------
-- Table structure for `census`
-- ----------------------------
DROP TABLE IF EXISTS `census`;
CREATE TABLE `census` (
  `cen_id` int(11) NOT NULL AUTO_INCREMENT,
  `cen_month` varchar(20) NOT NULL,
  `cen_day` int(2) NOT NULL,
  `cen_activenum` int(8) DEFAULT NULL,
  `cen_loginnum` int(8) DEFAULT NULL,
  `cen_onlinenum` int(8) DEFAULT NULL,
  `cen_activetotal` int(11) DEFAULT NULL,
  PRIMARY KEY (`cen_id`)
) ENGINE=InnoDB AUTO_INCREMENT=83 DEFAULT CHARSET=utf8;

-- ----------------------------
-- Records of census
-- ----------------------------
INSERT INTO `census` VALUES ('34', '2016-09', '1', '0', '0', '0', '0');
INSERT INTO `census` VALUES ('37', '2016-09', '2', '0', '0', '0', '0');
INSERT INTO `census` VALUES ('38', '2016-09', '3', '0', '0', '0', '0');
INSERT INTO `census` VALUES ('39', '2016-09', '4', '0', '0', '0', '0');
INSERT INTO `census` VALUES ('40', '2016-09', '5', '0', '0', '0', '0');
INSERT INTO `census` VALUES ('41', '2016-09', '6', '0', '0', '0', '0');
INSERT INTO `census` VALUES ('42', '2016-09', '7', '0', '0', '0', '0');
INSERT INTO `census` VALUES ('43', '2016-09', '8', '6', '0', '0', '6');
INSERT INTO `census` VALUES ('44', '2016-09', '9', '35', '9', '4', '41');
INSERT INTO `census` VALUES ('45', '2016-09', '10', '14', '27', '14', '55');
INSERT INTO `census` VALUES ('47', '2016-09', '11', '1', '14', '5', '56');
INSERT INTO `census` VALUES ('48', '2016-09', '12', '2', '16', '4', '58');
INSERT INTO `census` VALUES ('49', '2016-09', '13', '0', '8', '5', '58');
INSERT INTO `census` VALUES ('50', '2016-09', '14', '2', '11', '6', '60');
INSERT INTO `census` VALUES ('51', '2016-09', '15', '0', '8', '4', '60');
INSERT INTO `census` VALUES ('52', '2016-09', '16', '0', '3', '2', '60');
INSERT INTO `census` VALUES ('53', '2016-09', '17', '0', '4', '3', '60');
INSERT INTO `census` VALUES ('54', '2016-09', '18', '2', '3', '4', '62');
INSERT INTO `census` VALUES ('55', '2016-09', '19', '0', '4', '4', '62');
INSERT INTO `census` VALUES ('56', '2016-09', '20', '0', '2', '4', '62');
INSERT INTO `census` VALUES ('57', '2016-09', '21', '1', '5', '4', '63');
INSERT INTO `census` VALUES ('58', '2016-09', '22', '1', '6', '5', '64');
INSERT INTO `census` VALUES ('59', '2016-09', '23', '0', '3', '4', '64');
INSERT INTO `census` VALUES ('60', '2016-09', '24', '0', '4', '3', '64');
INSERT INTO `census` VALUES ('61', '2016-09', '25', '0', '5', '4', '64');
INSERT INTO `census` VALUES ('62', '2016-09', '26', '1', '3', '3', '65');
INSERT INTO `census` VALUES ('63', '2016-09', '27', '75', '81', '24', '140');
INSERT INTO `census` VALUES ('64', '2016-09', '28', '81', '103', '33', '221');
INSERT INTO `census` VALUES ('65', '2016-09', '29', '94', '0', '43', '315');
INSERT INTO `census` VALUES ('66', '2016-09', '30', '5', '31', '43', '320');
INSERT INTO `census` VALUES ('67', '2016-10', '1', '1', '18', '40', '321');
INSERT INTO `census` VALUES ('68', '2016-10', '2', '3', '19', '40', '324');
INSERT INTO `census` VALUES ('69', '2016-10', '3', '2', '15', '41', '326');
INSERT INTO `census` VALUES ('70', '2016-10', '4', '1', '14', '40', '327');
INSERT INTO `census` VALUES ('71', '2016-10', '5', '2', '12', '38', '329');
INSERT INTO `census` VALUES ('72', '2016-10', '6', '1', '12', '38', '330');
INSERT INTO `census` VALUES ('73', '2016-10', '7', '0', '9', '40', '330');
INSERT INTO `census` VALUES ('74', '2016-10', '8', '0', '5', '41', '330');
INSERT INTO `census` VALUES ('75', '2016-10', '9', '3', '10', '41', '333');
INSERT INTO `census` VALUES ('76', '2016-10', '10', '0', '7', '43', '333');
INSERT INTO `census` VALUES ('77', '2016-10', '11', '0', '0', '41', '333');
INSERT INTO `census` VALUES ('78', '2016-10', '13', '0', '0', '41', '333');
INSERT INTO `census` VALUES ('79', '2016-10', '12', '0', '2', '34', '333');
INSERT INTO `census` VALUES ('80', '2016-10', '14', '0', '0', '41', '0');
INSERT INTO `census` VALUES ('81', '2016-10', '31', '0', '0', '41', '0');
INSERT INTO `census` VALUES ('82', '2016-11', '1', '0', '0', '1', '0');

-- ----------------------------
-- Table structure for `money`
-- ----------------------------
DROP TABLE IF EXISTS `money`;
CREATE TABLE `money` (
  `mon_id` int(11) NOT NULL AUTO_INCREMENT,
  `mon_no` varchar(50) NOT NULL,
  `mon_alipay` varchar(50) NOT NULL,
  `mon_name` varchar(15) NOT NULL,
  `mon_pay` double(6,2) NOT NULL,
  `mon_comment` varchar(50) DEFAULT NULL,
  `mon_state` int(1) NOT NULL,
  `mon_type` varchar(80) DEFAULT NULL,
  `mon_time` varchar(20) DEFAULT '',
  `mon_phone` varchar(20) NOT NULL,
  PRIMARY KEY (`mon_id`)
) ENGINE=InnoDB AUTO_INCREMENT=2387 DEFAULT CHARSET=utf8;

-- ----------------------------
-- Records of money
-- ----------------------------
INSERT INTO `money` VALUES ('2195', '201609091648147700510', '15775690059', '缪梦颖', '0.01', '/', '0', '【任务发布】悬赏金(平台余额支付)', '2016-09-09', '15775690059');
INSERT INTO `money` VALUES ('2196', '201609091701451450510', '15775690059', '缪梦颖', '1.00', '/', '0', '【任务发布】悬赏金(平台余额支付)', '2016-09-09', '15775690059');
INSERT INTO `money` VALUES ('2197', '201609091702436140225', '15775691975', '杨成', '0.01', '/', '1', '【任务发布】悬赏金(平台余额支付)', '2016-09-09', '15775691975');
INSERT INTO `money` VALUES ('2198', '201609091711572230510', '15775690059', '缪梦颖', '1.00', '/', '1', '【任务发布】悬赏金(平台余额支付)', '2016-09-09', '15775690059');
INSERT INTO `money` VALUES ('2199', '201609091715568630225', '15775691975', '杨成', '0.01', '/', '2', '【任务完成】赏金', '2016-09-09', '15775691975');
INSERT INTO `money` VALUES ('2200', '201609091722197200510', '15775690059', '缪梦颖', '0.90', '/', '2', '【撤销任务】返金', '2016-09-09', '15775690059');
INSERT INTO `money` VALUES ('2201', '201609091749197860510', '15775690059', '缪梦颖', '0.90', '/', '3', '【撤销任务】返金', '2016-09-09', '15775690059');
INSERT INTO `money` VALUES ('2202', '201609091750425840510', '15775690059', '缪梦颖', '0.01', '/', '3', '【撤销任务】返金', '2016-09-09', '15775690059');
INSERT INTO `money` VALUES ('2203', '201609091808171690514', '15708181300', '宝哥姐姐', '2.00', '/', '4', '【任务发布】悬赏金(支付宝支付)', '2016-09-09', '15708181300');
INSERT INTO `money` VALUES ('2204', '201609091810080750514', '15708181300', '宝哥姐姐', '1.80', '/', '4', '【超时任务】返金', '2016-09-09', '15708181300');
INSERT INTO `money` VALUES ('2205', '201609091815480000218', '1907472272@qq.com', '冉椿林', '2.00', '/', '4', '【任务发布】悬赏金(支付宝支付)', '2016-09-09', '15775692033');
INSERT INTO `money` VALUES ('2206', '201609091905083830218', '1907472272@qq.com', '冉椿林', '1.80', '/', '3', '【超时任务】返金', '2016-09-09', '15775692033');
INSERT INTO `money` VALUES ('2209', '201609092001375960510', '15775690059', '缪梦颖', '0.90', '/', '3', '【撤销任务】返金', '2016-09-09', '15775690059');
INSERT INTO `money` VALUES ('2210', '201609092001478610510', '15775690059', '缪梦颖', '0.90', '/', '5', '【撤销任务】返金', '2016-09-09', '15775690059');
INSERT INTO `money` VALUES ('2211', '201609092008344520218', '1907472272@qq.com', '冉椿林', '2.00', '/', '4', '【任务发布】悬赏金(支付宝支付)', '2016-09-09', '15775692033');
INSERT INTO `money` VALUES ('2215', '201609092052455130218', '1907472272@qq.com', '冉椿林', '1.80', '/', '3', '【超时任务】返金', '2016-09-09', '15775692033');
INSERT INTO `money` VALUES ('2216', '201609092106077900218', '1907472272@qq.com', '冉椿林', '1.80', '/', '0', '【超时任务】返金', '2016-09-09', '15775692033');
INSERT INTO `money` VALUES ('2217', '201609100756340500225', '15775691975', '杨成', '2.00', '/', '4', '【任务发布】悬赏金(支付宝支付)', '2016-09-10', '15775691975');
INSERT INTO `money` VALUES ('2218', '201609100803202120109', '15708182472', '韩兰', '1.60', '/', '3', '【任务完成】赏金', '2016-09-10', '15708182472');
INSERT INTO `money` VALUES ('2219', '201609100809001690225', '15775691975', '杨成', '10.00', '/', '4', '【任务发布】悬赏金(支付宝支付)', '2016-09-10', '15775691975');
INSERT INTO `money` VALUES ('2220', '201609100816457170109', '15708182472', '韩兰', '5.00', '/', '4', '【任务发布】悬赏金(支付宝支付)', '2016-09-10', '15708182472');
INSERT INTO `money` VALUES ('2221', '201609100854473730218', '1907472272@qq.com', '冉椿林', '2.00', '/', '4', '【任务发布】悬赏金(支付宝支付)', '2016-09-10', '15775692033');
INSERT INTO `money` VALUES ('2222', '201609101125302980510', '15775690059', '缪梦颖', '2.00', '/', '4', '【任务发布】悬赏金(支付宝支付)', '2016-09-10', '15775690059');
INSERT INTO `money` VALUES ('2223', '201609101127104690510', '15775690059', '缪梦颖', '1.80', '/', '2', '【超时任务】返金', '2016-09-10', '15775690059');
INSERT INTO `money` VALUES ('2224', '201609101128160780112', '15281248360', '王潇琳', '2.00', '/', '1', '【任务发布】悬赏金(支付宝支付)', '2016-09-10', '15708182475');
INSERT INTO `money` VALUES ('2225', '201609101134105290510', '15775690059', '缪梦颖', '1.80', '/', '3', '【超时任务】返金', '2016-09-10', '15775690059');
INSERT INTO `money` VALUES ('2226', '201609101141138700510', '15775690059', '缪梦颖', '1.80', '/', '1', '【超时任务】返金', '2016-09-10', '15775690059');
INSERT INTO `money` VALUES ('2227', '201609101142428540510', '15775690059', '缪梦颖', '10.00', '/', '4', '【任务发布】悬赏金(支付宝支付)', '2016-09-10', '15775690059');
INSERT INTO `money` VALUES ('2228', '201609101148142170510', '15775690059', '缪梦颖', '1.80', '/', '3', '【超时任务】返金', '2016-09-10', '15775690059');
INSERT INTO `money` VALUES ('2229', '201609101155190970218', '1907472272@qq.com', '冉椿林', '1.80', '/', '3', '【超时任务】返金', '2016-09-10', '15775692033');
INSERT INTO `money` VALUES ('2230', '201609101155191440510', '15775690059', '缪梦颖', '1.80', '/', '3', '【超时任务】返金', '2016-09-10', '15775690059');
INSERT INTO `money` VALUES ('2231', '201609101245129310109', '15708182472', '韩兰', '1.60', '/', '3', '【任务完成】赏金', '2016-09-10', '15708182472');
INSERT INTO `money` VALUES ('2232', '201609101246217120510', '15775690059', '缪梦颖', '5.00', '/', '4', '【任务发布】悬赏金(支付宝支付)', '2016-09-10', '15775690059');
INSERT INTO `money` VALUES ('2233', '201609101539565110510', '15775690059', '缪梦颖', '5.00', '/', '4', '【任务发布】悬赏金(支付宝支付)', '2016-09-10', '15775690059');
INSERT INTO `money` VALUES ('2234', '201609101657494190510', '15775690059', '缪梦颖', '5.00', '/', '4', '【任务发布】悬赏金(支付宝支付)', '2016-09-10', '15775690059');
INSERT INTO `money` VALUES ('2235', '201609102014166930225', '15775691975', '杨成', '2.00', '/', '4', '【任务发布】悬赏金(支付宝支付)', '2016-09-10', '15775691975');
INSERT INTO `money` VALUES ('2236', '201609102218050530218', '1907472272@qq.com', '冉椿林', '1.80', '/', '3', '【超时任务】返金', '2016-09-10', '15775692033');
INSERT INTO `money` VALUES ('2237', '201609102246556320218', '1907472272@qq.com', '冉椿林', '1.80', '/', '3', '【撤销任务】返金', '2016-09-10', '15775692033');
INSERT INTO `money` VALUES ('2238', '201609102257551470225', '15775691975', '杨成', '2.00', '/', '4', '【任务发布】悬赏金(支付宝支付)', '2016-09-10', '15775691975');
INSERT INTO `money` VALUES ('2239', '201609102305479440225', '15775691975', '杨成', '1.80', '/', '3', '【撤销任务】返金', '2016-09-10', '15775691975');
INSERT INTO `money` VALUES ('2240', '201609110125587190218', '1907472272@qq.com', '冉椿林', '2.00', '/', '4', '【任务发布】悬赏金(支付宝支付)', '2016-09-11', '15775692033');
INSERT INTO `money` VALUES ('2241', '201609110130234050218', '1907472272@qq.com', '冉椿林', '0.01', '/', '4', '【任务发布】悬赏金(支付宝支付)', '2016-09-11', '15775692033');
INSERT INTO `money` VALUES ('2242', '201609110135061530225', '15775691975', '杨成', '50.00', '/', '4', '【任务发布】悬赏金(支付宝支付)', '2016-09-11', '15775691975');
INSERT INTO `money` VALUES ('2243', '201609111223251180509', '15282857373', '钟悦', '4.00', '/', '3', '【任务完成】赏金', '2016-09-11', '15708181315');
INSERT INTO `money` VALUES ('2244', '201609111547514090225', '15775691975', '杨成', '0.01', '/', '3', '【任务完成】赏金', '2016-09-11', '15775691975');
INSERT INTO `money` VALUES ('2245', '201609120817385920109', '15708182472', '韩兰', '4.50', '/', '3', '【超时任务】返金', '2016-09-12', '15708182472');
INSERT INTO `money` VALUES ('2246', '201609120855388740218', '1907472272@qq.com', '冉椿林', '1.80', '/', '3', '【超时任务】返金', '2016-09-12', '15775692033');
INSERT INTO `money` VALUES ('2247', '201609120938362320218', '1907472272@qq.com', '冉椿林', '0.10', '/', '4', '【任务发布】悬赏金(支付宝支付)', '2016-09-12', '15775692033');
INSERT INTO `money` VALUES ('2248', '201609120940253590218', '1907472272@qq.com', '冉椿林', '0.10', '/', '4', '【任务发布】悬赏金(支付宝支付)', '2016-09-12', '15775692033');
INSERT INTO `money` VALUES ('2249', '201609120952219300218', '1907472272@qq.com', '冉椿林', '0.10', '/', '4', '【任务发布】悬赏金(支付宝支付)', '2016-09-12', '15775692033');
INSERT INTO `money` VALUES ('2250', '201609120953265250218', '1907472272@qq.com', '冉椿林', '0.09', '/', '3', '【超时任务】返金', '2016-09-12', '15775692033');
INSERT INTO `money` VALUES ('2251', '201609121004268570218', '1907472272@qq.com', '冉椿林', '0.09', '/', '3', '【超时任务】返金', '2016-09-12', '15775692033');
INSERT INTO `money` VALUES ('2252', '201609121143277790510', '15775690059', '缪梦颖', '9.00', '/', '3', '【超时任务】返金', '2016-09-12', '15775690059');
INSERT INTO `money` VALUES ('2253', '201609121246279480510', '15775690059', '缪梦颖', '4.50', '/', '3', '【超时任务】返金', '2016-09-12', '15775690059');
INSERT INTO `money` VALUES ('2254', '201609121253279760218', '1907472272@qq.com', '冉椿林', '0.09', '/', '3', '【超时任务】返金', '2016-09-12', '15775692033');
INSERT INTO `money` VALUES ('2255', '201609121540284770510', '15775690059', '缪梦颖', '4.50', '/', '3', '【超时任务】返金', '2016-09-12', '15775690059');
INSERT INTO `money` VALUES ('2256', '201609122258289980225', '15775691975', '杨成', '1.80', '/', '3', '【超时任务】返金', '2016-09-12', '15775691975');
INSERT INTO `money` VALUES ('2257', '201609130126292540218', '1907472272@qq.com', '冉椿林', '1.80', '/', '3', '【超时任务】返金', '2016-09-13', '15775692033');
INSERT INTO `money` VALUES ('2258', '201609130135292660225', '15775691975', '杨成', '45.00', '/', '3', '【超时任务】返金', '2016-09-13', '15775691975');
INSERT INTO `money` VALUES ('2259', '201609140855316410218', '1907472272@qq.com', '冉椿林', '1.80', '/', '3', '【超时任务】返金', '2016-09-14', '15775692033');
INSERT INTO `money` VALUES ('2260', '201609140939316710218', '1907472272@qq.com', '冉椿林', '0.09', '/', '3', '【超时任务】返金', '2016-09-14', '15775692033');
INSERT INTO `money` VALUES ('2261', '201609140940316870218', '1907472272@qq.com', '冉椿林', '0.09', '/', '3', '【超时任务】返金', '2016-09-14', '15775692033');
INSERT INTO `money` VALUES ('2262', '201609201641401920225', '15775691975', '杨成', '0.01', '/', '4', '【任务发布】悬赏金(支付宝支付)', '2016-09-20', '15775691975');
INSERT INTO `money` VALUES ('2263', '201609201701051990225', '15775691975', '杨成', '0.02', '/', '4', '【任务发布】悬赏金(支付宝支付)', '2016-09-20', '15775691975');
INSERT INTO `money` VALUES ('2264', '201609211138532560218', '1907472272@qq.com', '冉椿林', '0.01', '/', '4', '【任务发布】悬赏金(支付宝支付)', '2016-09-21', '15775692033');
INSERT INTO `money` VALUES ('2265', '201609211139295690218', '1907472272@qq.com', '冉椿林', '0.01', '/', '4', '【任务发布】悬赏金(支付宝支付)', '2016-09-21', '15775692033');
INSERT INTO `money` VALUES ('2266', '201609211316147820218', '1907472272@qq.com', '冉椿林', '1.60', '/', '3', '【超时未通过任务】赏金', '2016-09-21', '15775692033');
INSERT INTO `money` VALUES ('2267', '201609211327336460218', '1907472272@qq.com', '冉椿林', '1.80', '/', '3', '【超时任务】返金', '2016-09-21', '15775692033');
INSERT INTO `money` VALUES ('2268', '201609220917550010225', '15775691975', '杨成', '0.01', '/', '3', '【撤销任务】返金', '2016-09-22', '15775691975');
INSERT INTO `money` VALUES ('2269', '201609221142370950218', '1907472272@qq.com', '冉椿林', '1.60', '/', '3', '【超时未通过任务】赏金', '2016-09-22', '15775692033');
INSERT INTO `money` VALUES ('2270', '201609221701373080225', '15775691975', '杨成', '0.02', '/', '3', '【超时任务】返金', '2016-09-22', '15775691975');
INSERT INTO `money` VALUES ('2271', '201609230855394520218', '1907472272@qq.com', '冉椿林', '1.80', '/', '3', '【超时任务】返金', '2016-09-23', '15775692033');
INSERT INTO `money` VALUES ('2272', '201609231139396970218', '1907472272@qq.com', '冉椿林', '0.01', '/', '3', '【超时任务】返金', '2016-09-23', '15775692033');
INSERT INTO `money` VALUES ('2273', '201609231139397120218', '1907472272@qq.com', '冉椿林', '0.01', '/', '3', '【超时任务】返金', '2016-09-23', '15775692033');
INSERT INTO `money` VALUES ('2274', '201609231901401960218', '1907472272@qq.com', '冉椿林', '1.80', '/', '3', '【超时任务】返金', '2016-09-23', '15775692033');
INSERT INTO `money` VALUES ('2275', '201609232354387860523', '18284635612', '七月份的尾巴', '5.00', '/', '4', '【任务发布】悬赏金(支付宝支付)', '2016-09-23', '18608241952');
INSERT INTO `money` VALUES ('2276', '201609232359404710523', '18284635612', '七月份的尾巴', '4.50', '/', '3', '【超时任务】返金', '2016-09-23', '18608241952');
INSERT INTO `money` VALUES ('2277', '201609241308408370225', '15775691975', '杨成', '1.60', '/', '3', '【超时未通过任务】赏金', '2016-09-24', '15775691975');
INSERT INTO `money` VALUES ('2278', '201609271917099500510', '15775690059', '缪梦颖', '2.00', '/', '4', '【任务发布】悬赏金(支付宝支付)', '2016-09-27', '15775690059');
INSERT INTO `money` VALUES ('2279', '201609271920017940510', '15775690059', '缪梦颖', '2.00', '/', '4', '【任务发布】悬赏金(支付宝支付)', '2016-09-27', '15775690059');
INSERT INTO `money` VALUES ('2280', '201609271922055130510', '15775690059', '缪梦颖', '10.00', '/', '4', '【任务发布】悬赏金(支付宝支付)', '2016-09-27', '15775690059');
INSERT INTO `money` VALUES ('2281', '201609272020009280647', '15708180099', '15708180099', '10.00', '/', '4', '【任务发布】悬赏金(支付宝支付)', '2016-09-27', '15708180099');
INSERT INTO `money` VALUES ('2282', '201609272023230220647', '15708180099', '15708180099', '6.00', '/', '4', '【任务发布】悬赏金(支付宝支付)', '2016-09-27', '15708180099');
INSERT INTO `money` VALUES ('2283', '201609272026258810647', '15708180099', '15708180099', '6.00', '/', '4', '【任务发布】悬赏金(支付宝支付)', '2016-09-27', '15708180099');
INSERT INTO `money` VALUES ('2284', '201609272027307720647', '15708180099', '15708180099', '2.00', '/', '4', '【任务发布】悬赏金(支付宝支付)', '2016-09-27', '15708180099');
INSERT INTO `money` VALUES ('2285', '201609272156028000433', '15348142706', '陈爽', '0.01', '/', '4', '【任务发布】悬赏金(支付宝支付)', '2016-09-27', '15348142706');
INSERT INTO `money` VALUES ('2286', '201609272157431280433', '15348142706', '陈爽', '0.01', '/', '3', '【撤销任务】返金', '2016-09-27', '15348142706');
INSERT INTO `money` VALUES ('2287', '201609272239112540225', '15775691975', '杨成', '2.00', '/', '4', '【任务发布】悬赏金(支付宝支付)', '2016-09-27', '15775691975');
INSERT INTO `money` VALUES ('2288', '201609272242400050108', '15775692038', '杜婷', '2.00', '/', '4', '【任务发布】悬赏金(支付宝支付)', '2016-09-27', '15775692038');
INSERT INTO `money` VALUES ('2289', '201609272244586310108', '15775692038', '杜婷', '2.00', '/', '4', '【任务发布】悬赏金(支付宝支付)', '2016-09-27', '15775692038');
INSERT INTO `money` VALUES ('2290', '201609272245490850108', '15775692038', '杜婷', '2.00', '/', '4', '【任务发布】悬赏金(支付宝支付)', '2016-09-27', '15775692038');
INSERT INTO `money` VALUES ('2291', '201609272246058970225', '15775691975', '杨成', '2.00', '/', '4', '【任务发布】悬赏金(支付宝支付)', '2016-09-27', '15775691975');
INSERT INTO `money` VALUES ('2292', '201609272246236940225', '15775691975', '杨成', '2.00', '/', '4', '【任务发布】悬赏金(支付宝支付)', '2016-09-27', '15775691975');
INSERT INTO `money` VALUES ('2293', '201609272246507260225', '15775691975', '杨成', '2.00', '/', '4', '【任务发布】悬赏金(支付宝支付)', '2016-09-27', '15775691975');
INSERT INTO `money` VALUES ('2294', '201609272247033040108', '15775692038', '杜婷', '2.00', '/', '4', '【任务发布】悬赏金(支付宝支付)', '2016-09-27', '15775692038');
INSERT INTO `money` VALUES ('2295', '201609272247049290225', '15775691975', '杨成', '2.00', '/', '4', '【任务发布】悬赏金(支付宝支付)', '2016-09-27', '15775691975');
INSERT INTO `money` VALUES ('2296', '201609272247260850225', '15775691975', '杨成', '2.00', '/', '4', '【任务发布】悬赏金(支付宝支付)', '2016-09-27', '15775691975');
INSERT INTO `money` VALUES ('2297', '201609272248046790108', '15775692038', '杜婷', '2.00', '/', '4', '【任务发布】悬赏金(支付宝支付)', '2016-09-27', '15775692038');
INSERT INTO `money` VALUES ('2298', '201609272249306330108', '15775692038', '杜婷', '2.00', '/', '4', '【任务发布】悬赏金(支付宝支付)', '2016-09-27', '15775692038');
INSERT INTO `money` VALUES ('2299', '201609272250210400108', '15775692038', '杜婷', '2.00', '/', '4', '【任务发布】悬赏金(支付宝支付)', '2016-09-27', '15775692038');
INSERT INTO `money` VALUES ('2300', '201609272251195710108', '15775692038', '杜婷', '2.00', '/', '4', '【任务发布】悬赏金(支付宝支付)', '2016-09-27', '15775692038');
INSERT INTO `money` VALUES ('2301', '201609272252493690108', '15775692038', '杜婷', '2.00', '/', '4', '【任务发布】悬赏金(支付宝支付)', '2016-09-27', '15775692038');
INSERT INTO `money` VALUES ('2302', '201609272253366660108', '15775692038', '杜婷', '2.00', '/', '4', '【任务发布】悬赏金(支付宝支付)', '2016-09-27', '15775692038');
INSERT INTO `money` VALUES ('2303', '201609281049528680225', '15775691975', '杨成', '2.00', '/', '4', '【任务发布】悬赏金(支付宝支付)', '2016-09-28', '15775691975');
INSERT INTO `money` VALUES ('2305', '201609281310245420510', '15775690059', '缪梦颖', '10.00', '/', '4', '【任务发布】悬赏金(支付宝支付)', '2016-09-28', '15775690059');
INSERT INTO `money` VALUES ('2306', '201609281320244023026', '1507544522', '他', '8.00', '/', '3', '【任务完成】赏金', '2016-09-28', '15984789257');
INSERT INTO `money` VALUES ('2307', '201609281334458920510', '15775690059', '缪梦颖', '40.00', '/', '4', '【任务发布】悬赏金(支付宝支付)', '2016-09-28', '15775690059');
INSERT INTO `money` VALUES ('2308', '201609291923096110218', '1907472272@qq.com', '冉椿林', '2.00', '/', '3', '【超时任务】返金', '2016-09-29', '15775692033');
INSERT INTO `money` VALUES ('2309', '201609291923096270218', '1907472272@qq.com', '冉椿林', '2.00', '/', '3', '【超时任务】返金', '2016-09-29', '15775692033');
INSERT INTO `money` VALUES ('2310', '201609291923096420218', '1907472272@qq.com', '冉椿林', '2.00', '/', '3', '【超时任务】返金', '2016-09-29', '15775692033');
INSERT INTO `money` VALUES ('2311', '201609291923096580218', '1907472272@qq.com', '冉椿林', '2.00', '/', '3', '【超时任务】返金', '2016-09-29', '15775692033');
INSERT INTO `money` VALUES ('2312', '201609291923096730218', '1907472272@qq.com', '冉椿林', '2.00', '/', '3', '【超时任务】返金', '2016-09-29', '15775692033');
INSERT INTO `money` VALUES ('2313', '201609291923096890218', '1907472272@qq.com', '冉椿林', '2.00', '/', '3', '【超时任务】返金', '2016-09-29', '15775692033');
INSERT INTO `money` VALUES ('2314', '201609291923097200218', '1907472272@qq.com', '冉椿林', '2.00', '/', '3', '【超时任务】返金', '2016-09-29', '15775692033');
INSERT INTO `money` VALUES ('2315', '201609291923097360218', '1907472272@qq.com', '冉椿林', '2.00', '/', '3', '【超时任务】返金', '2016-09-29', '15775692033');
INSERT INTO `money` VALUES ('2316', '201609291923097670218', '1907472272@qq.com', '冉椿林', '2.00', '/', '3', '【超时任务】返金', '2016-09-29', '15775692033');
INSERT INTO `money` VALUES ('2317', '201609291923097830218', '1907472272@qq.com', '冉椿林', '2.00', '/', '3', '【超时任务】返金', '2016-09-29', '15775692033');
INSERT INTO `money` VALUES ('2318', '201609291923097980218', '1907472272@qq.com', '冉椿林', '2.00', '/', '3', '【超时任务】返金', '2016-09-29', '15775692033');
INSERT INTO `money` VALUES ('2319', '201609291923098140218', '1907472272@qq.com', '冉椿林', '2.00', '/', '3', '【超时任务】返金', '2016-09-29', '15775692033');
INSERT INTO `money` VALUES ('2320', '201609291923098300218', '1907472272@qq.com', '冉椿林', '2.00', '/', '3', '【超时任务】返金', '2016-09-29', '15775692033');
INSERT INTO `money` VALUES ('2321', '201609291923098450218', '1907472272@qq.com', '冉椿林', '2.00', '/', '3', '【超时任务】返金', '2016-09-29', '15775692033');
INSERT INTO `money` VALUES ('2322', '201609291923098610218', '1907472272@qq.com', '冉椿林', '2.00', '/', '3', '【超时任务】返金', '2016-09-29', '15775692033');
INSERT INTO `money` VALUES ('2323', '201609291923098770218', '1907472272@qq.com', '冉椿林', '2.00', '/', '3', '【超时任务】返金', '2016-09-29', '15775692033');
INSERT INTO `money` VALUES ('2324', '201609291923098920218', '1907472272@qq.com', '冉椿林', '2.00', '/', '3', '【超时任务】返金', '2016-09-29', '15775692033');
INSERT INTO `money` VALUES ('2325', '201609291923099080218', '1907472272@qq.com', '冉椿林', '2.00', '/', '3', '【超时任务】返金', '2016-09-29', '15775692033');
INSERT INTO `money` VALUES ('2326', '201609291923099230218', '1907472272@qq.com', '冉椿林', '2.00', '/', '3', '【超时任务】返金', '2016-09-29', '15775692033');
INSERT INTO `money` VALUES ('2327', '201609291923099390218', '1907472272@qq.com', '冉椿林', '2.00', '/', '3', '【超时任务】返金', '2016-09-29', '15775692033');
INSERT INTO `money` VALUES ('2328', '201609291923099550218', '1907472272@qq.com', '冉椿林', '2.00', '/', '3', '【超时任务】返金', '2016-09-29', '15775692033');
INSERT INTO `money` VALUES ('2329', '201609291940015710128', '15708182016', 'LE', '0.50', '/', '3', '【任务完成】赏金', '2016-09-29', '15708182016');
INSERT INTO `money` VALUES ('2330', '201609292020102010647', '15708180099', '15708180099', '10.00', '/', '3', '【超时任务】返金', '2016-09-29', '15708180099');
INSERT INTO `money` VALUES ('2331', '201609292024102450647', '15708180099', '15708180099', '6.00', '/', '3', '【超时任务】返金', '2016-09-29', '15708180099');
INSERT INTO `money` VALUES ('2332', '201609292027102740647', '15708180099', '15708180099', '6.00', '/', '3', '【超时任务】返金', '2016-09-29', '15708180099');
INSERT INTO `money` VALUES ('2333', '201609292028102890647', '15708180099', '15708180099', '2.00', '/', '3', '【超时任务】返金', '2016-09-29', '15708180099');
INSERT INTO `money` VALUES ('2336', '201609292243016180108', '15775692038', '杜婷', '2.00', '/', '3', '【超时任务】返金', '2016-09-29', '15775692038');
INSERT INTO `money` VALUES ('2337', '201609292245088610108', '15775692038', '杜婷', '2.00', '/', '3', '【超时任务】返金', '2016-09-29', '15775692038');
INSERT INTO `money` VALUES ('2338', '201609292246106340108', '15775692038', '杜婷', '2.00', '/', '3', '【超时任务】返金', '2016-09-29', '15775692038');
INSERT INTO `money` VALUES ('2339', '201609292247106500108', '15775692038', '杜婷', '2.00', '/', '3', '【超时任务】返金', '2016-09-29', '15775692038');
INSERT INTO `money` VALUES ('2340', '201609292248106810108', '15775692038', '杜婷', '2.00', '/', '3', '【超时任务】返金', '2016-09-29', '15775692038');
INSERT INTO `money` VALUES ('2341', '201609292250106970108', '15775692038', '杜婷', '2.00', '/', '3', '【超时任务】返金', '2016-09-29', '15775692038');
INSERT INTO `money` VALUES ('2342', '201609292251107280108', '15775692038', '杜婷', '2.00', '/', '3', '【超时任务】返金', '2016-09-29', '15775692038');
INSERT INTO `money` VALUES ('2343', '201609292251243180108', '15775692038', '杜婷', '2.00', '/', '3', '【超时任务】返金', '2016-09-29', '15775692038');
INSERT INTO `money` VALUES ('2344', '201609292253107440108', '15775692038', '杜婷', '2.00', '/', '3', '【超时任务】返金', '2016-09-29', '15775692038');
INSERT INTO `money` VALUES ('2345', '201609292254107590108', '15775692038', '杜婷', '2.00', '/', '3', '【超时任务】返金', '2016-09-29', '15775692038');
INSERT INTO `money` VALUES ('2351', '201609301115205180510', '15775690059', '缪梦颖', '40.00', '/', '4', '【任务发布】悬赏金(支付宝支付)', '2016-09-30', '15775690059');
INSERT INTO `money` VALUES ('2360', '201609301228282460626', '15708186743', '青青子衿', '40.00', '/', '3', '【任务完成】赏金', '2016-09-30', '15708186743');
INSERT INTO `money` VALUES ('2362', '201609301306199270225', '15775691975', '杨成', '1.00', '/', '4', '【任务发布】悬赏金(支付宝支付)', '2016-09-30', '15775691975');
INSERT INTO `money` VALUES ('2364', '201610011923116270430', '', '欧尚付', '2.00', '/', '3', '【超时任务】返金', '2016-10-01', '');
INSERT INTO `money` VALUES ('2365', '201610011923116580430', '', '欧尚付', '2.00', '/', '3', '【超时任务】返金', '2016-10-01', '');
INSERT INTO `money` VALUES ('2366', '201610011923116730430', '', '欧尚付', '2.00', '/', '3', '【超时任务】返金', '2016-10-01', '');
INSERT INTO `money` VALUES ('2367', '201610011923116890430', '', '欧尚付', '2.00', '/', '3', '【超时任务】返金', '2016-10-01', '');
INSERT INTO `money` VALUES ('2368', '201610011923117050430', '', '欧尚付', '2.00', '/', '3', '【超时任务】返金', '2016-10-01', '');
INSERT INTO `money` VALUES ('2369', '201610011923117200430', '', '欧尚付', '2.00', '/', '3', '【超时任务】返金', '2016-10-01', '');
INSERT INTO `money` VALUES ('2370', '201610011923117360430', '', '欧尚付', '2.00', '/', '3', '【超时任务】返金', '2016-10-01', '');
INSERT INTO `money` VALUES ('2371', '201610011923117520430', '', '欧尚付', '2.00', '/', '3', '【超时任务】返金', '2016-10-01', '');
INSERT INTO `money` VALUES ('2372', '201610011923117670430', '', '欧尚付', '2.00', '/', '3', '【超时任务】返金', '2016-10-01', '');
INSERT INTO `money` VALUES ('2373', '201610011923117830430', '', '欧尚付', '2.00', '/', '3', '【超时任务】返金', '2016-10-01', '');
INSERT INTO `money` VALUES ('2374', '201610011923117830430', '', '欧尚付', '2.00', '/', '3', '【超时任务】返金', '2016-10-01', '');
INSERT INTO `money` VALUES ('2375', '201610011923117980430', '', '欧尚付', '2.00', '/', '3', '【超时任务】返金', '2016-10-01', '');
INSERT INTO `money` VALUES ('2376', '201610011923118140430', '', '欧尚付', '2.00', '/', '3', '【超时任务】返金', '2016-10-01', '');
INSERT INTO `money` VALUES ('2377', '201610011923118300430', '', '欧尚付', '2.00', '/', '3', '【超时任务】返金', '2016-10-01', '');
INSERT INTO `money` VALUES ('2378', '201610011923118450430', '', '欧尚付', '2.00', '/', '3', '【超时任务】返金', '2016-10-01', '');
INSERT INTO `money` VALUES ('2379', '201610011923118770430', '', '欧尚付', '2.00', '/', '3', '【超时任务】返金', '2016-10-01', '');
INSERT INTO `money` VALUES ('2380', '201610011923119080430', '', '欧尚付', '2.00', '/', '3', '【超时任务】返金', '2016-10-01', '');
INSERT INTO `money` VALUES ('2381', '201610011923119390430', '', '欧尚付', '2.00', '/', '3', '【超时任务】返金', '2016-10-01', '');
INSERT INTO `money` VALUES ('2382', '201610011923119550430', '', '欧尚付', '2.00', '/', '3', '【超时任务】返金', '2016-10-01', '');
INSERT INTO `money` VALUES ('2383', '201610011923119700430', '', '欧尚付', '2.00', '/', '3', '【超时任务】返金', '2016-10-01', '');
INSERT INTO `money` VALUES ('2384', '201610021307136690225', '15775691975', '杨成', '1.00', '/', '3', '【超时任务】返金', '2016-10-02', '15775691975');
INSERT INTO `money` VALUES ('2385', '201610021438364380510', '15775690059', '缪梦颖', '3.00', '/', '4', '【任务发布】悬赏金(支付宝支付)', '2016-10-02', '15775690059');
INSERT INTO `money` VALUES ('2386', '201610041439151820510', '15775690059', '缪梦颖', '3.00', '/', '3', '【超时任务】返金', '2016-10-04', '15775690059');

-- ----------------------------
-- Table structure for `pay`
-- ----------------------------
DROP TABLE IF EXISTS `pay`;
CREATE TABLE `pay` (
  `pay_id` int(11) NOT NULL AUTO_INCREMENT,
  `pay_time` varchar(40) NOT NULL,
  `pay_in` double(11,2) DEFAULT NULL,
  `pay_out` double(11,2) DEFAULT NULL,
  `pay_user` int(11) NOT NULL,
  PRIMARY KEY (`pay_id`),
  KEY `FK_user_pay` (`pay_user`),
  CONSTRAINT `pay_ibfk_1` FOREIGN KEY (`pay_user`) REFERENCES `users` (`use_id`) ON DELETE CASCADE ON UPDATE CASCADE
) ENGINE=InnoDB AUTO_INCREMENT=5 DEFAULT CHARSET=utf8;

-- ----------------------------
-- Records of pay
-- ----------------------------
INSERT INTO `pay` VALUES ('4', '2016-09', '3.20', '7.06', '1914');

-- ----------------------------
-- Table structure for `power`
-- ----------------------------
DROP TABLE IF EXISTS `power`;
CREATE TABLE `power` (
  `pow_id` int(11) NOT NULL AUTO_INCREMENT,
  `pow_fast` int(11) DEFAULT NULL,
  `pow_credit` int(11) DEFAULT NULL,
  `pow_user` int(11) NOT NULL,
  PRIMARY KEY (`pow_id`),
  KEY `FK_user_power` (`pow_user`),
  CONSTRAINT `power_ibfk_1` FOREIGN KEY (`pow_user`) REFERENCES `users` (`use_id`) ON DELETE CASCADE ON UPDATE CASCADE
) ENGINE=InnoDB AUTO_INCREMENT=132 DEFAULT CHARSET=utf8;

-- ----------------------------
-- Records of power
-- ----------------------------
INSERT INTO `power` VALUES ('131', '8', '59', '1914');

-- ----------------------------
-- Table structure for `tag`
-- ----------------------------
DROP TABLE IF EXISTS `tag`;
CREATE TABLE `tag` (
  `tag_id` int(11) NOT NULL AUTO_INCREMENT,
  `tag_logtime` varchar(40) DEFAULT NULL,
  `tag_timeout` int(11) unsigned DEFAULT NULL,
  `tag_distance` int(11) DEFAULT NULL,
  `tag_sex` varchar(20) DEFAULT NULL,
  `tag_tasktype` varchar(30) DEFAULT NULL,
  `tag_user` int(11) NOT NULL,
  PRIMARY KEY (`tag_id`),
  KEY `FK_user_tag` (`tag_user`),
  CONSTRAINT `tag_ibfk_1` FOREIGN KEY (`tag_user`) REFERENCES `users` (`use_id`) ON DELETE CASCADE ON UPDATE CASCADE
) ENGINE=InnoDB AUTO_INCREMENT=4 DEFAULT CHARSET=utf8 COMMENT='InnoDB free: 8192 kB; (`用户id`) REFER `hunter/user`(`用户id`)';

-- ----------------------------
-- Records of tag
-- ----------------------------
INSERT INTO `tag` VALUES ('3', '69,85,72,17', '462', null, '5,4', '5,9,1', '1914');

-- ----------------------------
-- Table structure for `task`
-- ----------------------------
DROP TABLE IF EXISTS `task`;
CREATE TABLE `task` (
  `tas_id` int(11) NOT NULL AUTO_INCREMENT,
  `tas_title` varchar(30) NOT NULL,
  `tas_img` varchar(50) DEFAULT NULL,
  `tas_contact` varchar(30) NOT NULL,
  `tas_content` text,
  `tas_time` varchar(40) NOT NULL,
  `tas_price` double(11,2) NOT NULL,
  `tas_type` varchar(8) NOT NULL,
  `tas_user` int(11) NOT NULL,
  `tas_state` int(1) NOT NULL,
  `tas_timeout` varchar(40) NOT NULL,
  `tas_finishtime` varchar(40) DEFAULT NULL,
  `tas_rulenum` int(4) DEFAULT NULL,
  `tas_receivenum` int(4) DEFAULT NULL,
  `tas_finishnum` int(4) DEFAULT NULL,
  `tas_evaluate` text,
  `tas_credit` int(1) DEFAULT NULL,
  PRIMARY KEY (`tas_id`),
  KEY `FK_user_task` (`tas_user`),
  CONSTRAINT `FK_user_task` FOREIGN KEY (`tas_user`) REFERENCES `users` (`use_id`) ON DELETE CASCADE ON UPDATE CASCADE
) ENGINE=InnoDB AUTO_INCREMENT=121 DEFAULT CHARSET=utf8;

-- ----------------------------
-- Records of task
-- ----------------------------
INSERT INTO `task` VALUES ('97', '帮我去点个名', null, '1642571305', '明天下午五点帮我去510教室点到。，2015级5班', '2016-09-09 18:15:48', '2.00', '个人', '1914', '0', '2016-11-23 19:00:48', null, null, null, null, '任务已过平台显示时间且无人接受，导致任务失败', null);
INSERT INTO `task` VALUES ('98', '帮我扫教室', null, '1642571305', '嘿嘿，谁帮我扫教室，谢谢了', '2016-09-09 20:08:34', '2.00', '加急个人', '1914', '0', '2016-11-23 20:09:00', '2016-09-22 13:07:54', null, null, null, '任务进入审核阶段两天，任务自动完成', '1');
INSERT INTO `task` VALUES ('102', '来2个代练王者荣耀的', 'upload/20160910085259.jpg', 'QQ1642571305', '连赢10把就行，具体可以QQ联系', '2016-09-10 08:54:47', '2.00', '团队', '1914', '0', '2016-11-23 08:54:47', null, '2', '0', '0', '任务已过平台显示时间且无人接受，导致任务失败', null);
INSERT INTO `task` VALUES ('111', '找人代课', null, '1642571305', '明天，帮我去502教室上课，。老区哈，，', '2016-09-11 01:25:58', '2.00', '个人', '1914', '0', '2016-11-13 01:25:58', null, null, null, null, '任务已过平台显示时间且无人接受，导致任务失败', null);
INSERT INTO `task` VALUES ('112', '帮忙扫地', null, '1642571305', '帮我，。。。。。。14558455', '2016-09-11 01:30:23', '0.01', '加急个人', '1914', '0', '2016-11-11 01:31:00', '2016-09-11 15:46:11', null, null, null, 'ghjjsjdjdjjjjjjjjjjjjjdjd', '3');
INSERT INTO `task` VALUES ('114', '求QQ关注', null, '1642571305', '关注一个一角钱。。。。。', '2016-09-12 09:38:36', '0.10', '个人', '1914', '0', '2016-11-14 09:38:36', null, null, null, null, '任务已过平台显示时间且无人接受，导致任务失败', null);
INSERT INTO `task` VALUES ('115', '找四个人一起开黑，', null, '1642571305', '找四个人开黑，本任务只是用来传播找人消息，赏金不重要。', '2016-09-12 09:40:25', '0.10', '团队', '1914', '0', '2016-11-14 09:40:25', null, '4', '0', '0', '任务已过平台显示时间且无人接受，导致任务失败', null);
INSERT INTO `task` VALUES ('116', '帮忙带个饭', null, '1642571305', '一舍216............', '2016-09-12 09:52:21', '0.10', '加急个人', '1914', '0', '2016-11-12 12:53:00', null, null, null, null, '加急任务已过时限，导致任务失败', null);
INSERT INTO `task` VALUES ('119', '测试任务', null, '15775691975', '了了了了了了了了了了', '2016-09-21 11:38:53', '0.01', '个人', '1914', '0', '2016-11-23 11:38:53', null, null, null, null, '任务已过平台显示时间且无人接受，导致任务失败', null);
INSERT INTO `task` VALUES ('120', '测试任务2', null, '15775691975', '啦咯啦咯啦咯了了了了了了了了了了了了', '2016-09-21 11:39:29', '0.01', '个人', '1914', '0', '2016-11-23 11:39:29', null, null, null, null, '任务已过平台显示时间且无人接受，导致任务失败', null);

-- ----------------------------
-- Table structure for `users`
-- ----------------------------
DROP TABLE IF EXISTS `users`;
CREATE TABLE `users` (
  `use_id` int(11) NOT NULL AUTO_INCREMENT,
  `use_sno` varchar(20) NOT NULL,
  `use_nickname` varchar(20) DEFAULT NULL,
  `use_name` varchar(20) NOT NULL,
  `use_pwd` varchar(10) NOT NULL,
  `use_sex` varchar(2) NOT NULL DEFAULT '',
  `use_age` int(2) DEFAULT NULL,
  `use_img` varchar(100) DEFAULT NULL,
  `use_moods` int(11) DEFAULT NULL,
  `use_alipay` varchar(50) DEFAULT NULL,
  `use_sign` varchar(300) DEFAULT NULL,
  `use_collegetime` varchar(4) NOT NULL,
  `use_phone` varchar(13) DEFAULT NULL,
  `use_idcard` varchar(18) DEFAULT NULL,
  `use_acceptnum` int(11) DEFAULT NULL,
  `use_publishnum` int(11) DEFAULT NULL,
  `use_depart` varchar(30) NOT NULL,
  `use_college` varchar(30) DEFAULT NULL,
  `use_major` varchar(20) DEFAULT NULL,
  `use_collegesize` int(1) DEFAULT NULL,
  `use_showsign` int(1) DEFAULT NULL,
  `use_refresh` varchar(40) DEFAULT NULL,
  `use_address` varchar(60) DEFAULT NULL,
  `use_emei` varchar(20) DEFAULT NULL,
  `use_isprotect` int(1) unsigned zerofill NOT NULL DEFAULT '1',
  `use_iscompany` int(1) NOT NULL,
  `use_isonline` int(1) NOT NULL DEFAULT '0',
  `use_islogin` int(1) NOT NULL,
  `use_remain` double(11,2) NOT NULL DEFAULT '0.00',
  PRIMARY KEY (`use_id`,`use_sex`),
  KEY `学号` (`use_sno`),
  KEY `学号_2` (`use_sno`),
  KEY `年龄` (`use_age`),
  KEY `年龄_2` (`use_age`)
) ENGINE=InnoDB AUTO_INCREMENT=1920 DEFAULT CHARSET=utf8 COMMENT='用户擅长类别属性：标签选最的一个\r\n用户能力值属性：通过计算标签所有相关属性得到';

-- ----------------------------
-- Records of users
-- ----------------------------
INSERT INTO `users` VALUES ('1914', '201310930218', '阴天', '冉椿林', '123456', '男', '22', 'upload/20131093021820160929095710.jpg', '0', '1907472272@qq.com', '喜羊羊', '2013', '15775692033', '512212145512255', '16', '45', '智能制造学院', '四川文理学院', '计算机科学与技术', '4', '1', '2016.10.15 22:43:23', '四川省南充市营山县小桥镇', '868679020272292', '1', '0', '0', '1', '35.29');
INSERT INTO `users` VALUES ('1919', '201310930223', '', '任杨', '930223', '男', '0', '', '0', '', '', '2013', '', '', '0', '0', '智能制造学院', '四川文理学院', null, null, '1', '', '', '', '1', '2', '0', '0', '0.00');
